{
    "EmmaPesjak": [
        "Initial commit"
    ],
    "Emma Pesjak": [
        "Initial commit\n\nMVC structure set up.",
        "Added gitignore",
        "Exit handling\n\nFeature: Added functionality for closing the application.",
        "Layout\n\nFeature:Configured a grid layout to have one side menu bar and one expandable window for the rest of the application.",
        "Menubar created\n\nFeature: The menu bar is configured and a dark/light mode has been added.",
        "Feature: user specific data\n\nAdded functionality so that a new window opens when selecting a user.",
        "Feature\n\nAdded frames to the user menu layout",
        "Fix: refactor\n\nRefactored and moved cominstance attributes to the __init__ metod.",
        "Fix: refactor\n\nRefactored and added comments",
        "Fix: Diagram display/update\n\nChanged so that the diagrams and repo information is only displayed after a repository has been selected. The diagrams/infobar is also updated after a new repo is selected.",
        "Feature: Loading repo in sepatate thread\n\nAdded functionality for fetching repositories in a separate thread. Also added a loading widget",
        "Feature: DataVisualizer\n\nBreak out the diagram making into a separate class.",
        "Fix: loading\n\nFixed so that all old data is removed from the GUI and only the loading text is visible while getting new repositories."
    ],
    "ebbanimer": [
        "Tested commit",
        "git commit -m \"Added test-data\" -m \"Added dummy data to configure the UI.\"",
        "git commit -m \"Root and menu created.\" -m \"Created a base UI with an options-menu.\"",
        "Refactored view\n\nRefactored mainview to be more readable aby separating code into methods.",
        "Added diagrams\n\nFeature: Added charts to overview with test data, using matplot.lib",
        "Refactored diagrams\n\nChanged layout of diagrams to a grid",
        "Feature\n\nAdded diagrams for specific user.",
        "Feature\n\nAdded info-text in info-bar",
        "Feature\n\nAdded the event listener for the repo-input, which will be passed to model for data mining",
        "Pydriller set up\n\nSet up PyDriller and retrieved data from repository path",
        "Author git mining\n\nRetrieves authors from provided repository",
        "Feature\n\nRetrieves correct amount of commits for project",
        "Feature\n\nWrites authors with its commits to json file",
        "Feature\n\nAdded method for getting total amount of commits, to be updated in view."
    ]
}